<?php
session_start()
?>
<?php
include 'db1.php';
?>
<html>

<head>
<meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
<title>news</title>
<link href="style.css" rel="stylesheet" type="text/css"/>
<link href="menu.css" rel="stylesheet" type="text/css"/>
<link href="fonts.css" rel="stylesheet" type="text/css"/>

</head>

<body>

<div class="maindiv">

<div class="forheader"><h1><a href="index.html" class="main_a" style="font-family:colonna mt;">Galaxy Football</a></h1></div>

<ul id="menu">
<li><a class="a_mmenu" href="index.php"><b>Головна<b style="font-size:0,8em;"></a></li>S
<li><a class="a_mmenu" href="news.php"><b>Новини<b></a></li>
<li><a class="a_mmenu" href="match.php"><b>Матчі<b></a></li>
<li><a class="a_mmenu" href="https://www.uefa.com/"><b>UEFA<b></a></li>
<li><a class="a_mmenu" href="chleague.php"><b>Ліга Чемпіонів<b></a></li>
<li><a class="a_mmenu" href="eleague.php"><b>Ліга Європи<b></a></li>
<li><a class="a_mmenu" href="team.php"><b>Збірна<b></a></li>
</ul>

<div class="forbody">
<p id="zina">Зінченко став найдорожчим українським футболістом:</p></br>
<img src="photos\zina.jpg" id="photozina">
<p id="textzina">Наші гравці в останні роки продовжують прогресувати і все краще проявляють себе в європейських чемпіонатах.
Після поновлення трансферної вартості найдорожчим українським футболістом став Олександр Зінченко. Ціна гравця за даними Transfermarkt зросла з 20 до 30 мільйонів євро.
Нагадаємо, що раніше Зінченко ділив вершину (20 мільйонів євро) з Андрієм Ярмоленко і Віктором Циганкова. Вартість даних виконавців не змінилася.
Четверта позиція як і раніше залишилася у півзахисника Аталанти Руслана Малиновського (12,5 мільйона євро), а замикає п'ятірку Марлос з вартістю в 11 мільйонів євро. Андрій Лунін, в свою чергу, розташовується на восьмому місці і оцінюється в 7,5 мільйона євро.
Олександр Зінченко, яким влітку цікавився Ювентус, зміг відзначитися двома забитими голами за збірну України в матчах проти Литви та Нігерії.</p></br></br></br></br>

<p id="sarri">Саррі офіційно дебютує біля керма Ювентуса в матчі з Фіорентиною:</p></br>
<img src="photos\sarri.jpg" id="photosarri">
<p id="textsarri">Дебют Мауріціо Сарри на тренерському містку Ювентуса в офіційних матчах відбудеться в поєдинку третього туру першості Серії А проти Фіорентини - повідомляє Gazzetta dello Sport.
Сарри керував підготовкою Юве до сезону, проте захворів на пневмонію і не зміг бути присутнім на матчах перших двох турах Серії А, в яких його підопічні під керівництвом Джованні Мартускьелло здобули дві перемоги.
Матч Фіорентина - Ювентус відбудеться в суботу, 14 вересня. Початок о 16:00 за київським часом.</p></br></br></br></br>

<p id="kono">Коноплянка перейшов в Шахтар після розмови з Ахметовим:</p></br>
<img src="photos\kono.jpg" id="photokono">
<p id="textkono">Коноплянка перебрався в Шахтар в останній день трансферного вікна.
"Рінат Леонідович набрав мене, поговорили. Для мене це, якщо чесно, дуже приємно. Залишилися почуття після цієї розмови, правда. Велика людина", - сказав Коноплянка в інтерв'ю Великому футболу.
"І коли таким розмовою він зі мною підтримує зв'язок, ну це дуже приємно. Тому що як ніби знаю його десять років. Приємно подвійно. Хочеться залишити світла пляма в цьому клубі".
Євген Коноплянка буде виступати в Шахтарі під №15 - повідомив офіційний сайт клубу.
До переходу в Шахтар Євген виступав за Дніпро, Севілью і Шальке. У складі національної збірної України провів 82 матчі (21 гол)</p></br></br></br></br>

<p id="messi">Мессі: "Не впевнений, що Барселона зробила все можливе для повернення Неймара":</p></br>
<img src="photos\messi.jpg" id="photomessi">
<p id="textmessi">Ліонель Мессі шкодує, що Барселона не повернула Неймара з ПСЖ, але вважає, що його команда і без бразильця досить сильна.
"Я нікуди не збираюся йти, тут мій дім, - цитує аргентинця Marca. - Я хочу і далі перемагати з Барселоною. Звичайно, я б хотів, щоб Неймар повернувся. Він - один з найсильніших футболістів світу, і з ним клуб зміг би зробити якісний стрибок. я знаю, що переговори з ПСЖ проходили дуже важко, але при цьому не впевнений, що Барселона зробила абсолютно все можливе для повернення Неймара. все ж я не можу назвати свої емоції розчаруванням. У нас вражаючий склад, який зможе добитися нових перемог ".
Після трьох турів чемпіонату Іспанії Барселона з чотирма очками посідає восьме місце. У суботу, 14 вересня, чемпіон зіграє вдома з Валенсією в Прімері, а у вівторок, 17 вересня, розпочне виступи в Лізі чемпіонів виїзним поєдинком проти Боруссії Д</p></br>

<?php
require('db1.php');
if(isset($_POST['username']) and isset($_POST['password'])){
$username= $_POST['username'];
$password= $_POST['password'];

$query = "SELECT * FROM user WHERE username='$username' and password='$password'";
$result = mysqli_query($connection,$query) or die(mysqli_error($connection));
$count = mysqli_num_rows($result);

if($count == 1){
$_SESSION['username'] = $username;
}else{
$fmsg="Помилка";
}
}
if(isset($_SESSION['username'])){
$test= $_SESSION['username'];
echo "hello".$test . " ";
echo " Ви війшли";
echo"<a href='logout.php'> Вихід </a>";
}
?>

</div> 

</div> 

<div class="footer">Khmelnitsky.Ukraine.2019</div>

</div>

</body>

</html>